<!-- dflook/terraform-github-actions {"workspace":"default","backend":"38cb4fee30288b9f9153039e4be2ea266e8485afa395e6a319d4d2595bc81b97","backend_type":"azurerm"} -->
Terraform plan in __.__
<details>
<summary>Plan: 19 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cassandra-rg"
      + tags     = {
          + "dept" = "IT Dept"
        }
    }

  # azurerm_subnet.isesubnet1 will be created
  + resource "azurerm_subnet" "isesubnet1" {
      + address_prefixes                               = [
          + "172.16.0.0/27",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "isesubnet1"
      + resource_group_name                            = "cassandra-rg"
      + virtual_network_name                           = "cassandra-vnet"

      + delegation {
          + name = "ise"

          + service_delegation {
              + name = "Microsoft.Logic/integrationServiceEnvironments"
            }
        }
    }

  # azurerm_subnet.isesubnet2 will be created
  + resource "azurerm_subnet" "isesubnet2" {
      + address_prefixes                               = [
          + "172.16.0.32/27",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "isesubnet1"
      + resource_group_name                            = "cassandra-rg"
      + virtual_network_name                           = "cassandra-vnet"
    }

  # azurerm_subnet.isesubnet3 will be created
  + resource "azurerm_subnet" "isesubnet3" {
      + address_prefixes                               = [
          + "172.16.0.64/27",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "isesubnet1"
      + resource_group_name                            = "cassandra-rg"
      + virtual_network_name                           = "cassandra-vnet"
    }

  # azurerm_subnet.isesubnet4 will be created
  + resource "azurerm_subnet" "isesubnet4" {
      + address_prefixes                               = [
          + "172.16.0.96/27",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "isesubnet1"
      + resource_group_name                            = "cassandra-rg"
      + virtual_network_name                           = "cassandra-vnet"
    }

  # azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "172.16.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "cassandra-subnet"
      + resource_group_name                            = "cassandra-rg"
      + virtual_network_name                           = "cassandra-vnet"
    }

  # azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "172.16.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cassandra-vnet"
      + resource_group_name = "cassandra-rg"
      + subnet              = (known after apply)
    }

  # module.ise.azurerm_integration_service_environment.this will be created
  + resource "azurerm_integration_service_environment" "this" {
      + access_endpoint_type            = "Internal"
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "hax-ise"
      + resource_group_name             = "cassandra-rg"
      + sku_name                        = "Developer_0"
      + virtual_network_subnet_ids      = (known after apply)
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)

      + timeouts {
          + create = "300m"
          + delete = "300m"
          + read   = "5m"
          + update = "300m"
        }
    }

  # module.cassandra.module.cassandra.data.local_file.node_ips will be read during apply
  # (config refers to values not yet known)
 <= data "local_file" "node_ips"  {
      + content        = (known after apply)
      + content_base64 = (known after apply)
      + filename       = "/tmp/terraform-data-dir/modules/cassandra.cassandra/nodes_ips.txt"
      + id             = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_cosmosdb_cassandra_cluster.this will be created
  + resource "azurerm_cosmosdb_cassandra_cluster" "this" {
      + authentication_method          = "Cassandra"
      + default_admin_password         = (sensitive value)
      + delegated_management_subnet_id = (known after apply)
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "cassandra-cl"
      + repair_enabled                 = true
      + resource_group_name            = "cassandra-rg"
      + version                        = "3.11"

      + timeouts {
          + create = "60m"
          + delete = "60m"
        }
    }

  # module.cassandra.module.cassandra.azurerm_cosmosdb_cassandra_datacenter.this will be created
  + resource "azurerm_cosmosdb_cassandra_datacenter" "this" {
      + availability_zones_enabled     = false
      + cassandra_cluster_id           = (known after apply)
      + delegated_management_subnet_id = (known after apply)
      + disk_count                     = 4
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "cassandra-cl-dc"
      + node_count                     = 3
      + sku_name                       = "Standard_D8s_v4"

      + timeouts {
          + create = "60m"
          + delete = "60m"
        }
    }

  # module.cassandra.module.cassandra.azurerm_lb.this will be created
  + resource "azurerm_lb" "this" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "cassandra-cl-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "cassandra-rg"
      + sku                  = "Standard"
      + sku_tier             = "Regional"

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "PrivateIPAddress"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "172.16.1.100"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool.this will be created
  + resource "azurerm_lb_backend_address_pool" "this" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "cassandra-cl-nodes"
      + outbound_rules            = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[0] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = (known after apply)
      + name                    = "node-1"
      + virtual_network_id      = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[1] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = (known after apply)
      + name                    = "node-2"
      + virtual_network_id      = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[2] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = (known after apply)
      + name                    = "node-3"
      + virtual_network_id      = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_lb_probe.this will be created
  + resource "azurerm_lb_probe" "this" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "cassandra"
      + number_of_probes    = 2
      + port                = 9042
      + protocol            = (known after apply)
    }

  # module.cassandra.module.cassandra.azurerm_lb_rule.this will be created
  + resource "azurerm_lb_rule" "this" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 9042
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "PrivateIPAddress"
      + frontend_port                  = 9042
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "cassandra"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.cassandra.module.cassandra.azurerm_role_assignment.this will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "************************************"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cassandra.module.cassandra.null_resource.get_nodes_ips will be created
  + resource "null_resource" "get_nodes_ips" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform #20](https://github.com/hybridaccess/nonprod-test-infra/actions/runs/2606794161)